---
kind: method
id: M:Autodesk.Revit.DB.Outline.GetDiagonalLength
source: html/430fa61d-2390-f491-774f-486e4975cf78.htm
---
# Autodesk.Revit.DB.Outline.GetDiagonalLength Method

Get the length of outline's diagonal. If called on empty outline, 0.
 is returned

## Syntax (C#)
```csharp
public double GetDiagonalLength()
```

## Returns
The length of the diagonal.